; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-5degree-100mindistance-2trucks-5packages-469seed

(define (problem transport-two-cities-sequential-4nodes-1000size-5degree-100mindistance-2trucks-5packages-469seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 305,681 -> 271,812
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 14)
  ; 271,812 -> 305,681
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 14)
  ; 260,427 -> 271,812
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 39)
  ; 271,812 -> 260,427
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 39)
  ; 260,427 -> 305,681
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 26)
  ; 305,681 -> 260,427
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 26)
  ; 661,388 -> 271,812
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 58)
  ; 271,812 -> 661,388
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 58)
  ; 661,388 -> 305,681
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 47)
  ; 305,681 -> 661,388
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 47)
  ; 661,388 -> 260,427
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 41)
  ; 260,427 -> 661,388
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 41)
  ; 2256,42 -> 2668,58
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 42)
  ; 2668,58 -> 2256,42
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 42)
  ; 2256,42 -> 2096,761
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 74)
  ; 2096,761 -> 2256,42
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 74)
  ; 2223,767 -> 2096,761
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 13)
  ; 2096,761 -> 2223,767
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 13)
  ; 2223,767 -> 2256,42
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 73)
  ; 2256,42 -> 2223,767
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 73)
  ; 661,388 <-> 2096,761
  (road city-1-loc-4 city-2-loc-2)
  (= (road-length city-1-loc-4 city-2-loc-2) 149)
  (road city-2-loc-2 city-1-loc-4)
  (= (road-length city-2-loc-2 city-1-loc-4) 149)
  (at package-1 city-1-loc-2)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-1)
  (at package-4 city-1-loc-1)
  (at package-5 city-1-loc-2)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-4)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-3)
  (at package-5 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 5
2. (drive truck-1 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
3. (drive truck-1 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 5
4. (pick-up truck-1 city-1-loc-2 package-5 capacity-3 capacity-4)
   deleted: (at package-5 city-1-loc-2) (capacity truck-1 capacity-4)
   added: (in package-5 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 5
5. (pick-up truck-1 city-1-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-2) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 5
6. (drive truck-1 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
7. (drive truck-1 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 5
8. (drive truck-1 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 5
9. (drop truck-1 city-2-loc-3 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 1 of 5
10. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 5
11. (drive truck-1 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 1 of 5
12. (drive truck-1 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-1)
   goals met: 1 of 5
13. (pick-up truck-1 city-1-loc-1 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-1) (capacity truck-1 capacity-3)
   added: (in package-4 truck-1) (capacity truck-1 capacity-2)
   goals met: 1 of 5
14. (pick-up truck-1 city-1-loc-1 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-1) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 5
15. (pick-up truck-1 city-1-loc-1 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 5
16. (drive truck-1 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-4)
   goals met: 1 of 5
17. (drive truck-1 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 5
18. (drive truck-1 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-3)
   goals met: 1 of 5
19. (drop truck-1 city-2-loc-3 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 2 of 5
20. (drop truck-1 city-2-loc-3 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-2-loc-3) (capacity truck-1 capacity-2)
   goals met: 3 of 5
21. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 3 of 5
22. (drop truck-1 city-2-loc-4 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-2-loc-4) (capacity truck-1 capacity-3)
   goals met: 4 of 5
23. (drop truck-1 city-2-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-2-loc-4) (capacity truck-1 capacity-4)
   goals met: 5 of 5
